namespace Keyhanatr.Infrastructure
{
    public class PaymentResult
    {
        #region نمایش پیغام های نتیجه پرداخت پارسیان

        /// <summary>
        /// این متد یک ورودی گرفته و نتیجه پیغام را بر می گرداند
        // 1: به جز کد وضعیت 1- ، همۀ وضعیت هایی که مقدار آنها منفی است، مربوط به درگاه پرداخت اینترنتی پارسیان میباشد.
        // 2: وضعیت 0 به معناي موفق بودن عملیات میباشد.
        // 3: تمامی کدهاي وضعیت مثبت (بزرگتر از صفر) خطاهاي صادره از سوئیچ پرداخت میباشد
        /// </summary>
        /// <param name="resultId"></param>
        /// <returns></returns>
        public static string Parsian(string resultId)
        {
            string result = "";
            switch (resultId)
            {
                case "0":
                    result = "تراکنش با موفقیت انجام شد";
                    break;
                case "1":
                    result = "صادرکننده ي کارت از انجام تراکنش صرف نظر کرد";
                    break;
                case "2":
                    result = "عملیات تاییدیه این تراکنش قبلا باموفقیت صورت پذیرفته است";
                    break;
                case "3":
                    result = "پذیرنده ي فروشگاهی نامعتبر می باشد";
                    break;
                case "5":
                    result = "از انجام تراکنش صرف نظر شد";
                    break;
                case "6":
                    result = "بروز خطایی ناشناخته";
                    break;
                case "8":
                    result = "باتشخیص هویت دارنده ي کارت، تراکنش موفق می باشد";
                    break;
                case "9":
                    result = "درخواست رسیده در حال پی گیري و انجام است";
                    break;
                case "10":
                    result = "تراکنش با مبلغی پایین تر از مبلغ درخواستی یا کمبود حساب مشتري-- پذیرفته شده است";
                    break;
                case "12":
                    result = "تراکنش نامعتبر است";
                    break;
                case "13":
                    result = "مبلغ تراکنش نادرست است";
                    break;
                case "14":
                    result = "شماره کارت ارسالی نامعتبر است یاوجود ندارد";
                    break;
                case "15":
                    result = "صادرکننده ي کارت نامعتبراست یا وجود ندارد";
                    break;
                case "17":
                    result = "مشتري درخواست کننده حذف شده است";
                    break;
                case "20":
                    result = "در موقعیتی که سوئیچ جهت پذیرش تراکنش نیازمند پرس و جو از کارت است ممکن است درخواست از کارت ( ترمینال) بنماید این پیاممبین نامعتبر بودن جواب است";
                    break;
                case "21":
                    result = "در صورتی که پاسخ به در خواست ترمینا ل نیازمند هیچ پاسخ خاص یا عملکردي نباشیم این پیام را خواهیم داشت";
                    break;
                case "22":
                    result = "تراکنش مشکوك به بد عمل کردن ( کارت ، ترمینال ، دارنده کارت ) بوده است لذا پذیرفته نشده است";
                    break;
                case "30":
                    result = "قالب پیام داراي اشکال است";
                    break;
                case "31":
                    result = "پذیرنده توسط سوئی پشتیبانی نمی شود";
                    break;
                case "32":
                    result = "تراکنش به صورت غیر قطعی کامل شده است ( به عنوان مثال تراکنش سپرده گزاري که از دید مشتري کامل شده است ولی می بایست تکمیل گردد";
                    break;
                case "33":
                    result = "تاریخ انقضاي کارت سپري شده است";
                    break;
                case "38":
                    result = "تعداد دفعات ورود رمزغلط بیش از حدمجاز است. کارت توسط دستگاه ضبط شود";
                    break;
                case "39":
                    result = "کارت حساب اعتباري ندارد";
                    break;
                case "40":
                    result = "عملیات درخواستی پشتیبانی نمی گردد";
                    break;
                case "41":
                    result = "کارت مفقودي می باشد";
                    break;
                case "43":
                    result = "کارت مسروقه می باشد";
                    break;
                case "45":
                    result = "قبض قابل پرداخت نمی باشد";
                    break;
                case "51":
                    result = "موجودي کافی نمی باشد";
                    break;
                case "54":
                    result = "تاریخ انقضاي کارت سپري شده است";
                    break;
                case "55":
                    result = "رمز کارت نا معتبر است";
                    break;
                case "56":
                    result = "کارت نا معتبر است";
                    break;
                case "57":
                    result = "انجام تراکنش مربوطه توسط دارنده ي کارت مجاز نمی باشد";
                    break;
                case "58":
                    result = "انجام تراکنش مربوطه توسط پایانه ي انجام دهنده مجاز نمی باشد";
                    break;
                case "59":
                    result = "کارت مظنون به تقلب است";
                    break;
                case "61":
                    result = "مبلغ تراکنش بیش از حد مجاز می باشد";
                    break;
                case "62":
                    result = "کارت محدود شده است";
                    break;
                case "63":
                    result = "تمهیدات امنیتی نقضگردیده است";
                    break;
                case "65":
                    result = "تعداد درخواست تراکنش بیش از حد مجاز می باشد";
                    break;
                case "68":
                    result = "پاسخ لازم براي تکمیل یا انجام تراکنش خیلی دیر رسیده است";
                    break;
                case "69":
                    result = "تعداد دفعات تکرار رمز از حد مجاز گذشته است";
                    break;
                case "75":
                    result = "کارت فعال نیست است";
                    break;
                case "78":
                    result = "کارت فعال نیست";
                    break;
                case "79":
                    result = "حساب متصل به کارت نا معتبر است یا داراي اشکال است";
                    break;
                case "80":
                    result = "درخواست تراکنش رد شده است";
                    break;
                case "81":
                    result = "کارت پذیرفته نشد";
                    break;
                case "83":
                    result = "سرویس دهنده سوئیچ کارت تراکنش را نپذیرفته است";
                    break;
                case "84":
                    result = "در تراکنشهایی که انجام آن مستلزم ارتباط با صادر کننده است در صورت فعال نبودن صادر کننده این پیام در پاسخ ارسال خواهد شد";
                    break;
                case "91":
                    result = "سیستم صدور مجوز انجام تراکنش موقتا غیر فعال است و یا زمان تعیین شده براي صدور مجوز به پایان رسیده است";
                    break;
                case "92":
                    result = "مقصد تراکنش پیدا نشد";
                    break;
                case "93":
                    result = "امکان تکمیل تراکنش وجود ندارد";
                    break;
                ////////////////////////////////////////////////
                case "-1":
                    result = "خطاي سرور";
                    break;
                case "-100":
                    result = "پذیرنده غیرفعال می باشد";
                    break;
                case "-101":
                    result = "پذیرنده اهراز هویت نشد";
                    break;
                case "-102":
                    result = "تراکنش با موفقیت برگشت داده شد";
                    break;
                case "-103":
                    result = "قابلیت خرید براي پذیرنده غیر فعال می باشد";
                    break;
                case "-104":
                    result = "قابلیت پرداخت قبض براي پذیرنده غیر فعال";
                    break;
                case "-105":
                    result = "قابلیت تاپ آپ براي پذیرنده غیر فعال می باشد";
                    break;
                case "-106":
                    result = "قابلیت شارژ براي پذیرنده غیر فعال می باشد";
                    break;
                case "-107":
                    result = "قابلیت ارسال تاییده تراکنش براي پذیرنده غیر فعال می باشد";
                    break;
                case "-108":
                    result = "قابلیت برگشت تراکنش براي پذیرنده غیر فعال می باشد";
                    break;
                case "-111":
                    result = "مبلغ تراکنش بیش از حد مجاز پذیرنده می باشد";
                    break;
                case "-112":
                    result = "شماره سفارش تکراري است";
                    break;
                case "-113":
                    result = "پارامتر ورودي خالی می باشد";
                    break;
                case "-114":
                    result = "شناسه قبض نامعتبر می باشد";
                    break;
                case "-115":
                    result = "شناسه پرداخت نامعتبر می باشد";
                    break;
                case "-116":
                    result = "طول رشته بیش از حد مجاز می باشد";
                    break;
                case "-117":
                    result = "طول رشته کم تر از حد مجاز می باشد";
                    break;
                case "-118":
                    result = "مقدار ارسال شده عدد نمی باشد";
                    break;
                case "-119":
                    result = "سازمان نامعتبر می باشد";
                    break;
                case "-120":
                    result = "طول داده ورودي معتبر نمی باشد";
                    break;
                case "-121":
                    result = "رشته داده شده بطور کامل عددي نمی باشد";
                    break;
                case "-126":
                    result = "کد شناسایی پذیرنده معتبر نمی باشد";
                    break;
                case "-127":
                    result = "آدرس اینترنتی معتبر نمی باشد";
                    break;
                case "-128":
                    result = "معتبر نمی باشد IP قالب آدرس";
                    break;
                case "-130":
                    result = "زمان منقضی شده است Token";
                    break;
                case "-131":
                    result = "امعتبر می باشد Token";
                    break;
                case "-132":
                    result = "مبلغ تراکنش کمتر از حداقل مجاز میباشد";
                    break;
                case "-138":
                    result = "عملیات پرداخت توسط کاربر لغو شد";
                    break;
                case "-1505":
                    result = "تایید تراکنش توسط پذیرنده انجام شد";
                    break;
                case "-1507":
                    result = "تراکنش برگشت به سوئیچ ارسال شد";
                    break;
                case "-1527":
                    result = "انجام عملیات درخواست پرداخت تراکنش خرید ناموفق بود";
                    break;
                case "-1528":
                    result = "اطلاعات پرداخت یافت نشد";
                    break;
                case "-1530":
                    result = "پذیرنده مجاز به تایید این تراکنش نمی باشد";
                    break;
                case "-1531":
                    result = "تایید تراکنش ناموفق امکان پذیر نمی باشد";
                    break;
                case "-1532":
                    result = "تراکنش از سوي پذیرنده تایید شد";
                    break;
                case "-1533":
                    result = "تراکنش قبلاً تایید شده است";
                    break;
                case "-1536":
                    result = "فراخوانی سرویس درخواست شارژ تاپ آپ ناموفق بود";
                    break;
                case "-1540":
                    result = "تایید تراکنش ناموفق می باشد";
                    break;
                case "-1548":
                    result = "فراخوانی سرویس درخواست پرداخت قبض ناموفق بود";
                    break;
                case "-1549":
                    result = "زمان مجاز براي درخواست برگشت تراکنش به اتمام رسیده است";
                    break;
                case "-1550":
                    result = "برگشت تراکنش در وضعیت جاري امکان پذیر نمی باشد";
                    break;
                case "-1551":
                    result = "برگشت تراکنش قبلا اًنجام شده است";
                    break;
                case "-1552":
                    result = "برگشت تراکنش مجاز نمی باشد";
                    break;
                case "-32768":
                    result = "خطاي ناشناخته رخ داده است";
                    break;


                /*********************************************************/
                default:
                    result = "خطای نامشخص";
                    break;

            }
            return result;
        }

        #endregion

    }
}